In [1]:
#dependencies
import pandas as pd
import os

from sqlalchemy import create_engine, Column, Integer, String, Float, Date
from sqlalchemy.ext.declarative import declarative_base
#from sqlalchemy.orm.instrumentation import unregister_class

Base = declarative_base()

In [2]:
p_df = pd.read_excel('POV_Pivot_forjup_xlsx.xlsx')
p_df.head()

  Code      Country  ReportedYear  RatioValue
0  ABW        Aruba          1977         NaN
1  AFG  Afghanistan          1977         NaN
2  AGO       Angola          1977         NaN
3  ALB      Albania          1977         NaN
4  AND      Andorra          1977         NaN

In [3]:
i_df = pd.read_excel('income_forjup.xlsx')
i_df.head()

  Code Country  ReportedYear IncomeGroup
0  ABW   Aruba          1987           H
1  ABW   Aruba          1988           H
2  ABW   Aruba          1989           H
3  ABW   Aruba          1990           H
4  ABW   Aruba          1991          UM

In [4]:
#use the engine to create a database 
engine = create_engine('sqlite:///worldbank.sqlite')

In [5]:
class Poverty(Base):
    __tablename__ = 'poverty_headcount'
    id = Column(Integer, primary_key=True)
    Code = Column(String(32))
    Country = Column(String(255))
    ReportedYear = Column(Date)
    RatioValue = Column(Float)
    
class Income(Base):
    __tablename__ = 'income_group'
    id = Column(Integer, primary_key=True)
    Code = Column(String(32))
    Country = Column(String(255))
    ReportedYear = Column(Date)
    IncomeGroup = Column(String(32))

In [6]:
Base.metadata.create_all(engine)

In [7]:
engine.table_names()

['income_group', 'poverty_headcount']

In [9]:
p_df.to_sql('poverty_headcount', engine, if_exists = "append", index=False)
i_df.to_sql('income_group', engine, if_exists = "append", index=False)